Tekla Open API Reference for Tekla Structures 2025
ProfileSelectionForm Class
 The ProfileSelectionForm class represents a dialog to select profiles using the profile catalogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.UIControls.ProfileSelectionForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ProfileSelectionForm : Form
Public Class ProfileSelectionForm
	Inherits Form
The ProfileSelectionForm type exposes the following members.
Constructors
Name | Description
ProfileSelectionForm(List<LibraryProfileItem>, List<ParametricProfileItem>)
 Creates a new instance of the ProfileSelectionForm.
ProfileSelectionForm(List<LibraryProfileItem>, List<ParametricProfileItem>, String)
 Creates a new instance of the ProfileSelectionForm selecting the given profile in the tree control.
Top
Properties
Name | Description
SelectedProfile
 The selected profile.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace